
Процедура КаталогPopplerНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог = КаталогPoppler;
	
	Если Диалог.Выбрать() Тогда
		КаталогPoppler = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИмяФайлаНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файлы PDF|*.pdf";
	Диалог.ПолноеИмяФайла = ИмяФайла;
	
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	СохранитьЗначение("PDF_Extractor_КаталогPoppler"	, КаталогPoppler);
	СохранитьЗначение("PDF_Extractor_ИмяФайла"			, ИмяФайла);
	СохранитьЗначение("PDF_Extractor_ПерваяСтраница"	, ПерваяСтраница);
	СохранитьЗначение("PDF_Extractor_ПоследняяСтраница"	, ПоследняяСтраница);
	СохранитьЗначение("PDF_Extractor_ЧБ"				, ЧБ);
	СохранитьЗначение("PDF_Extractor_Формат"			, Формат);
	СохранитьЗначение("PDF_Extractor_Качество"			, Качество);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	КаталогPoppler = ВосстановитьЗначение("PDF_Extractor_КаталогPoppler");
	ИмяФайла = ВосстановитьЗначение("PDF_Extractor_ИмяФайла");
	
	ПерваяСтраница = ВосстановитьЗначение("PDF_Extractor_ПерваяСтраница");
	ПоследняяСтраница = ВосстановитьЗначение("PDF_Extractor_ПоследняяСтраница");
	ЧБ = ВосстановитьЗначение("PDF_Extractor_ЧБ");
	Формат = ВосстановитьЗначение("PDF_Extractor_Формат");
	Качество = ВосстановитьЗначение("PDF_Extractor_Качество");
	
	Если НЕ ЗначениеЗаполнено(Формат) Тогда
		Формат = "jpeg";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Качество) Тогда
		Качество = 200;
	КонецЕсли;
	
КонецПроцедуры

Процедура СтраницыКакИзображенияНажатие(Элемент)
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		
		Состояние("Извлечение страниц...");
		
		Изображения = ФайлВИзображения(ИмяФайла, Качество, ПерваяСтраница, ПоследняяСтраница, Формат, ЧБ);
		
		Состояние("Вывод результата...");
		
		Если Изображения <> Неопределено Тогда
		
			Счетчик = 0;
			КоличествоСтолбцов = 5;
			
			Если ТипЗнч(ДобавленныеЭлементы) = Тип("Массив") Тогда
				
				Для Каждого Элемент ИЗ ДобавленныеЭлементы Цикл
					ЭлементыФормы.Удалить(Элемент);
				КонецЦикла;
				
				ДобавленныеЭлементы.Очистить();
				
			Иначе			
				
				ДобавленныеЭлементы = Новый Массив();
				
			КонецЕсли;
			
			Для Каждого Изображение ИЗ Изображения Цикл		
				
				Если НЕ Изображение.Ошибка Тогда
				
					ПокаКартинки = ЭлементыФормы.Добавить(Тип("ПолеКартинки"), "Картинка_" + Счетчик, , ЭлементыФормы.ПанельРезультатов); 	
					ПокаКартинки.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная);
					ПокаКартинки.Лево = 100 * (Счетчик % КоличествоСтолбцов);
					ПокаКартинки.Верх = Цел((Счетчик / КоличествоСтолбцов)) * 100;
					ПокаКартинки.Высота = 100;
					ПокаКартинки.Ширина = 100;
					ПокаКартинки.РазмерКартинки = РазмерКартинки.Пропорционально;
					ПокаКартинки.Гиперссылка = Истина;
					ПокаКартинки.РазрешитьНачалоПеретаскивания = Ложь;		
					ПокаКартинки.ЦветРамки = WebЦвета.Черный;					
					ПокаКартинки.Подсказка = "Страница №" + Изображение.НомерСтраницы;
					ПокаКартинки.Картинка = Новый Картинка(Изображение.ДвоичныеДанные);
					
					ДобавленныеЭлементы.Добавить(ПокаКартинки);
					
					Счетчик = Счетчик + 1;
					
				КонецЕсли;
								
			КонецЦикла;
			
		Иначе
			
			Сообщить(ПоследняяОшибка(), СтатусСообщения.Внимание);
			
		КонецЕсли;
		
	Иначе
		
		Предупреждение("Не выбран файл!");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзвлечьИзображенияНажатие(Элемент)
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		
		Состояние("Извлечение изображений...");		
		
		Результаты = ИзображенияИзФайла(ИмяФайла, ПерваяСтраница, ПоследняяСтраница);
				
		Состояние("Вывод результата...");
		
		Если Результаты <> Неопределено Тогда
		
			Счетчик = 0;
			КоличествоСтолбцов = 5;
			
			Если ТипЗнч(ДобавленныеЭлементы) = Тип("Массив") Тогда
				
				Для Каждого Элемент ИЗ ДобавленныеЭлементы Цикл
					ЭлементыФормы.Удалить(Элемент);
				КонецЦикла;
				
				ДобавленныеЭлементы.Очистить();
				
			Иначе			
				
				ДобавленныеЭлементы = Новый Массив();
				
			КонецЕсли;
			
			Для Каждого Результат ИЗ Результаты Цикл		
				
				ПокаКартинки = ЭлементыФормы.Добавить(Тип("ПолеКартинки"), "Картинка_" + Счетчик, , ЭлементыФормы.ПанельРезультатов); 	
				ПокаКартинки.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная);
				ПокаКартинки.Лево = 100 * (Счетчик % КоличествоСтолбцов);
				ПокаКартинки.Верх = Цел((Счетчик / КоличествоСтолбцов)) * 100;
				ПокаКартинки.Высота = 100;
				ПокаКартинки.Ширина = 100;
				ПокаКартинки.РазмерКартинки = РазмерКартинки.Пропорционально;
				ПокаКартинки.Гиперссылка = Истина;
				ПокаКартинки.РазрешитьНачалоПеретаскивания = Ложь;		
				ПокаКартинки.ЦветРамки = WebЦвета.Черный;					
				ПокаКартинки.Подсказка = "Страница №" + Результат.НомерСтраницы + ", изображение №" + Результат.НомерИзображения + ", формат " + Результат.Расширение;
				ПокаКартинки.Картинка = Новый Картинка(Результат.ДвоичныеДанные);
				
				ДобавленныеЭлементы.Добавить(ПокаКартинки);
				
				Счетчик = Счетчик + 1;		
				
			КонецЦикла;
			
		Иначе
			
			Сообщить(ПоследняяОшибка(), СтатусСообщения.Внимание);
			
		КонецЕсли;
		
	Иначе
		
		Предупреждение("Не выбран файл!");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзвлечьКакТекстНажатие(Элемент)
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
	
		Страницы = ФайлВТекст(ИмяФайла, ПерваяСтраница, ПоследняяСтраница);
		
		Если Страницы <> Неопределено Тогда
			
			Файл = Новый ТекстовыйДокумент();
					
			Для Каждого Страница ИЗ Страницы Цикл				
				
				Если НЕ Страница.Ошибка Тогда
					Файл.ДобавитьСтроку("СТРАНИЦА №" + Страница.НомерСтраницы);
					Файл.ДобавитьСтроку(Страница.Текст);
					Файл.ДобавитьСтроку(Символы.ПС + "///////////////////////////////////////////////////////////" + Символы.ПС);
				КонецЕсли;
				
			КонецЦикла;
			
			Файл.Показать("Текст из файла " + ИмяФайла);
			
		Иначе
			
			Сообщить(ПоследняяОшибка(), СтатусСообщения.Внимание);
			
		КонецЕсли;
		
	Иначе
		
		Предупреждение("Не выбран файл!");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнформацияОФайлеНажатие(Элемент)
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
	
		Информация = СтрокаИнформацииОФайле(ИмяФайла);
		
		Если Информация <> Неопределено Тогда		
			Сообщить(Информация, СтатусСообщения.Информация);			
		Иначе			
			Сообщить(ПоследняяОшибка(), СтатусСообщения.Внимание);
		КонецЕсли;
	
	Иначе
		
		Предупреждение("Не выбран файл!");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОсновныеДействияФормыРазбитьФайл(Кнопка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файлы PDF|*.pdf";
	Диалог.Заголовок = "Выберите файл для разбиения";
	Диалог.ПолноеИмяФайла = ИмяФайла;
	
	Если Диалог.Выбрать() Тогда
		
		Файл = Диалог.ПолноеИмяФайла;
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);		
		Диалог.Заголовок = "Выберите каталог для сохранения результата";
		
		Если Диалог.Выбрать() Тогда
			
			Файлы = РазбитьФайл(Файл, Диалог.Каталог);
			
			Если Файлы <> Неопределено Тогда
				
				Для Каждого Файл ИЗ Файлы Цикл
					Сообщить("Создан файл: " + Файл.ПолноеИмя, СтатусСообщения.Информация);
				КонецЦикла;
				
			Иначе
				
				Сообщить(ПоследняяОшибка(), СтатусСообщения.Внимание);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОбъединитьФайлы(Кнопка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файлы PDF|*.pdf";
	Диалог.Заголовок = "Выберите файлы для объединения";
	Диалог.МножественныйВыбор = Истина;	
	
	Если Диалог.Выбрать() Тогда
		
		Файлы = Диалог.ВыбранныеФайлы;
				
		Диалог.МножественныйВыбор = Ложь;		
		Диалог.Заголовок = "Выберите файл для сохранения результата";
		
		Если Диалог.Выбрать() Тогда
							
			Файл = ОбъединитьНесколькоФайлов(Файлы, Диалог.ПолноеИмяФайла);
			
			Если Файл <> Неопределено Тогда							
				Сообщить("Создан файл: " + Файл, СтатусСообщения.Информация);								
			Иначе				
				Сообщить(ПоследняяОшибка(), СтатусСообщения.Внимание);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
